Revit 2016 API
IDuctFittingAndAccessoryPressureDropServer Interface
 Interface class for external servers implementing duct fitting and duct accessory coefficient calculation.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2014
Syntax
C#
public interface IDuctFittingAndAccessoryPressureDropServer : IExternalServer
Visual Basic
Public Interface IDuctFittingAndAccessoryPressureDropServer _
	Inherits IExternalServer
Visual C++
public interface class IDuctFittingAndAccessoryPressureDropServer : IExternalServer
See Also
IDuctFittingAndAccessoryPressureDropServer Members
Autodesk.Revit.DB.Mechanical Namespace